# HİYERARŞİK İNDEXLER

1.Hiyerarşik İndexlerle işlemler
2.Veri Setini stack ve unstacklama işlemleri
3.Hiyerarşik İndexlerli İsimlendirme
4.Hiyerarşik İndexlerli tekrar sıralama
5.Level(Seviye) Sıralama
6.Seviyelere göre özet istatistikleri bulma
7.DataFrame in sütunlarını satır indexine çevirme

In [1]:
import pandas as pd
import numpy as np

In [2]:
veri= pd.Series(np.random.randn(8),index=[["a","a","a","b","b","b","c","c"],
                                         [1,2,3,1,2,3,1,2]])

Burada satır indexleri birden fazladır. Dıştaki değerler 0(a,b,c) indexe sahip, içteki değerler de birinci indexe sahiptir. Verisetindeki satırlar iki seviyeden oluşur.

In [4]:
veri

a  1   -0.550006
   2    0.754172
   3    0.403349
b  1   -0.743283
   2   -1.274714
   3   -1.475086
c  1    0.952520
   2    0.322551
dtype: float64

Verinin index yapısını görmek için;

In [7]:
veri.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 2),
            ('b', 3),
            ('c', 1),
            ('c', 2)],
           )

Yalnıca "a" indexine sahip değerleri görmek için;

In [8]:
veri["a"]

1   -0.550006
2    0.754172
3    0.403349
dtype: float64

Veriyi dilimlemek istersek;

In [10]:
veri["b":"c"]

b  1   -0.743283
   2   -1.274714
   3   -1.475086
c  1    0.952520
   2    0.322551
dtype: float64

Birden fazla indexi almak için örneğin a ve c değerlerini beraber görmek istersek;

In [11]:
veri.loc[["a","c"]]

a  1   -0.550006
   2    0.754172
   3    0.403349
c  1    0.952520
   2    0.322551
dtype: float64

İçteki indexten değer seçebiliriz. Örneğin içteki indexin birinci değerini ekrana yazdırmak için;

In [12]:
veri.loc[:,1]

a   -0.550006
b   -0.743283
c    0.952520
dtype: float64

İstersek veriyi unstack methodu ile tablo halinde görebiliriz.

In [14]:
veri.unstack()

          1         2         3
a -0.550006  0.754172  0.403349
b -0.743283 -1.274714 -1.475086
c  0.952520  0.322551       NaN

unstacklanmış veriyi tekrar eski haline getirmek için stack methodunu kullanabiliriz.

In [17]:
veri.unstack().stack()

a  1   -0.550006
   2    0.754172
   3    0.403349
b  1   -0.743283
   2   -1.274714
   3   -1.475086
c  1    0.952520
   2    0.322551
dtype: float64

DataFrame yapısındaki veriler de hiyerarşik indexlere sahip olabilir.

In [18]:
vs=pd.DataFrame(np.arange(12).reshape(4,3),index=[["a","a","b","b"],[1,2,1,2]],
               columns=[["say","say","soz"],["mat","fiz","edb"]])

In [19]:
vs

    say     soz
    mat fiz edb
a 1   0   1   2
  2   3   4   5
b 1   6   7   8
  2   9  10  11

Dikkat edersek yukarıdaki verisetinde hiyerarşik indexlenme söz konusudur.

In [20]:
vs.index.names=["sinif","sinav"]
vs.columns.names=["alan","ders"]

In [21]:
vs

alan        say     soz
ders        mat fiz edb
sinif sinav
a     1       0   1   2
      2       3   4   5
b     1       6   7   8
      2       9  10  11

Verinin alt gruplarını seçmek isteyebiliriz. Say adlı indexi ekrana yazdırmak isteyelim.

In [22]:
vs.say

ders         mat  fiz
sinif sinav
a     1        0    1
      2        3    4
b     1        6    7
      2        9   10

Bazen indexlerin seviyelerini değiştirmek isteyebiliriz. Bunun için swaplevel komutu kullanılabilir. Sınıf ve sınav indexlerinin yerlerini değiştirmek istersek;

In [24]:
vs.swaplevel("sinif","sinav")

alan        say     soz
ders        mat fiz edb
sinav sinif
1     a       0   1   2
2     a       3   4   5
1     b       6   7   8
2     b       9  10  11

sort_index komutu seviyelere göre indexleri sıralar.Veriyi seviye bire göre sıralamak istersek;

In [26]:
vs.sort_index(level=1)

alan        say     soz
ders        mat fiz edb
sinif sinav
a     1       0   1   2
b     1       6   7   8
a     2       3   4   5
b     2       9  10  11

Eğer ki sort_index komutunun içini boş olursa, default olarak 0. indexe göre sıralama yapar.

In [28]:
vs.sort_index()

alan        say     soz
ders        mat fiz edb
sinif sinav
a     1       0   1   2
      2       3   4   5
b     1       6   7   8
      2       9  10  11

Series veya DataFrame yapısındaki özet istatistikler bir seviyeye göre bulunuyordu. Elimize birden fazla seviyeli veri varsa istediğimiz seviyeye göre özet istatistikleri elde edebiliriz. Örneğin verideki sayı seviyesine göre toplam değerleri bulmak istersek;

In [33]:
vs.sum(level="sinav")

C:\Users\derin\AppData\Local\Temp\ipykernel_14928\2729217126.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  vs.sum(level="sinav")

alan  say     soz
ders  mat fiz edb
sinav
1       6   8  10
2      12  14  16

In [34]:
vs.sum(level="alan",axis=1)

C:\Users\derin\AppData\Local\Temp\ipykernel_14928\2185710206.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  vs.sum(level="alan",axis=1)

alan         say  soz
sinif sinav
a     1        1    2
      2        7    5
b     1       13    8
      2       19   11

DataFrame in sutünlarını satır indexine taşımak mümkündür. Bunun için bir veri seti ele alalım;

In [35]:
veri=pd.DataFrame({"x":range(8),"y":range(8,0,-1),
                  "a":["bir","bir","bir","bir","iki","iki","iki","iki"],
                  "b":[0,1,2,3,0,1,2,3]})

In [36]:
veri

   x  y    a  b
0  0  8  bir  0
1  1  7  bir  1
2  2  6  bir  2
3  3  5  bir  3
4  4  4  iki  0
5  5  3  iki  1
6  6  2  iki  2
7  7  1  iki  3

Şimdi bu verisetinin a ve b sütunlarını satır indexi şeklinde yazalim.

In [39]:
veri2 =veri.set_index(["a","b"])

In [40]:
veri2

       x  y
a   b
bir 0  0  8
    1  1  7
    2  2  6
    3  3  5
iki 0  4  4
    1  5  3
    2  6  2
    3  7  1

set_index methodunda satıra taşınan indexler sütundan kaldırılır. drop=False opsiyonu ile index olarak aldığımız sütunlar aynı yerinde kalır.

In [43]:
veri3=veri.set_index(["a","b"],drop=False)

In [44]:
veri3

       x  y    a  b
a   b
bir 0  0  8  bir  0
    1  1  7  bir  1
    2  2  6  bir  2
    3  3  5  bir  3
iki 0  4  4  iki  0
    1  5  3  iki  1
    2  6  2  iki  2
    3  7  1  iki  3

Veri setini eski haline getirmek için reset_index komutu kullanılır.

In [45]:
veri2

       x  y
a   b
bir 0  0  8
    1  1  7
    2  2  6
    3  3  5
iki 0  4  4
    1  5  3
    2  6  2
    3  7  1

In [46]:
veri2.reset_index()

     a  b  x  y
0  bir  0  0  8
1  bir  1  1  7
2  bir  2  2  6
3  bir  3  3  5
4  iki  0  4  4
5  iki  1  5  3
6  iki  2  6  2
7  iki  3  7  1